#### Pandas  - It is powerful data manipulation tool in python, widely used for data analysis and data cleaning. It provide two data structures, series and Dataframes. series is 1-D array object, and dataframes is 2-d, size mutable and potentially heterogenous tabelar data structure with labelled axes( row and column)

#### Data Manipulatrion and Analysis are the key concepts in any data science or data analysis projects. Pandas provide wide range of functions for data manipulation and analysis, makes easy to clean, transform, and extract insights from data.

In [2]:
import pandas as pd

In [3]:
##Series
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
#Dictionaries using series
data = {'a':1,'b':2,'c':3,'d':4,'e':5}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index = index)

a    10
b    20
c    30
dtype: int64

In [8]:
##Creating Dataframe from dictionary of list

data = {
    'Name' : ['Sri','Kaushik','Pamidimukkala'],
    'Age' : [26,27,28],
    'City' : ['Irving','Austin','San Diego']
}

In [10]:
df = pd.DataFrame(data)
df

            Name  Age       City
0            Sri   26     Irving
1        Kaushik   27     Austin
2  Pamidimukkala   28  San Diego

In [11]:
import numpy as np
np.array(df)

array([['Sri', 26, 'Irving'],
       ['Kaushik', 27, 'Austin'],
       ['Pamidimukkala', 28, 'San Diego']], dtype=object)

In [12]:
## List -> Dictionaries
data = [
    {
        'Name': 'Kaushik',
        'Age' : 25,
        'City' : 'Irving'
    },
    {
        'Name' : 'Sri',
        'Age' : 26,
        'City' : 'San Diego'
    },
    {
        'Name' : 'Pamidimukkala',
        'Age' : 27,
        'City' : 'Cary'
    }
]

df = pd.DataFrame(data)
df

            Name  Age       City
0        Kaushik   25     Irving
1            Sri   26  San Diego
2  Pamidimukkala   27       Cary

In [17]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,YEAR,MONTH,SUPPLIER,ITEM CODE,ITEM DESCRIPTION,ITEM TYPE,RETAIL SALES,RETAIL TRANSFERS,WAREHOUSE SALES
0,2020,1,REPUBLIC NATIONAL DISTRIBUTING CO,100009,BOOTLEG RED - 750ML,WINE,0.00,0.0,2.0
1,2020,1,PWSWN INC,100024,MOMENT DE PLAISIR - 750ML,WINE,0.00,1.0,4.0
2,2020,1,RELIABLE CHURCHILL LLLP,1001,S SMITH ORGANIC PEAR CIDER - 18.7OZ,BEER,0.00,0.0,1.0
3,2020,1,LANTERNA DISTRIBUTORS INC,100145,SCHLINK HAUS KABINETT - 750ML,WINE,0.00,0.0,1.0
4,2020,1,DIONYSOS IMPORTS INC,100293,SANTORINI GAVALA WHITE - 750ML,WINE,0.82,0.0,0.0

In [18]:
df.tail(5)

,YEAR,MONTH,SUPPLIER,ITEM CODE,ITEM DESCRIPTION,ITEM TYPE,RETAIL SALES,RETAIL TRANSFERS,WAREHOUSE SALES
307640,2020,9,LEGENDS LTD,99753,DUTCHESS DE BOURGOGNE NR - 750ML,BEER,0.00,0.0,5.00
307641,2020,9,ANHEUSER BUSCH INC,9997,HOEGAARDEN 4/6NR - 12OZ,BEER,66.12,37.0,240.75
307642,2020,9,COASTAL BREWING COMPANY LLC,99970,DOMINION OAK BARREL STOUT 4/6 NR - 12OZ,BEER,2.25,0.0,0.00
307643,2020,9,BOSTON BEER CORPORATION,99990,SAM ADAMS SUMMER VARIETY 12PK NR,BEER,20.50,0.0,0.00
307644,2020,9,NaN,WC,WINE CREDIT,REF,0.00,0.0,-70.00

In [19]:
data = [
    {
        'Name': 'Kaushik',
        'Age' : 25,
        'City' : 'Irving'
    },
    {
        'Name' : 'Sri',
        'Age' : 26,
        'City' : 'San Diego'
    },
    {
        'Name' : 'Pamidimukkala',
        'Age' : 27,
        'City' : 'Cary'
    }
]

df = pd.DataFrame(data)
df

            Name  Age       City
0        Kaushik   25     Irving
1            Sri   26  San Diego
2  Pamidimukkala   27       Cary

In [20]:
df['Name']

0          Kaushik
1              Sri
2    Pamidimukkala
Name: Name, dtype: object

In [21]:
##Row indec
df.loc[0]

Name    Kaushik
Age          25
City     Irving
Name: 0, dtype: object

In [23]:
#Column index
df.iloc[0][0]

/var/folders/m7/8hb2jgc92gj43v8ccht5z1b40000gn/T/ipykernel_57476/3464551283.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Kaushik'

In [24]:
df

            Name  Age       City
0        Kaushik   25     Irving
1            Sri   26  San Diego
2  Pamidimukkala   27       Cary

In [31]:
##Accessing Values
print(df.at[2,'Age'])

27

In [32]:
print(df.at[2,'Name'])

Pamidimukkala

In [34]:
##Accessing specified element using iat
print(df.iat[2,2])

Cary

In [36]:
##Data Maipulation in Dataframes
#Adding a column
df['Salary'] = [60000,70000,80000]
df

            Name  Age       City  Salary
0        Kaushik   25     Irving   60000
1            Sri   26  San Diego   70000
2  Pamidimukkala   27       Cary   80000

In [37]:
##Removing a column
df.drop('Salary')
##By defaul it is being checked inthe row index i.e., df.drop('Salary',axis=0)

KeyError: "['Salary'] not found in axis"

In [38]:
df.drop('Salary',axis=1)# Temporary drop of column

            Name  Age       City
0        Kaushik   25     Irving
1            Sri   26  San Diego
2  Pamidimukkala   27       Cary

In [39]:
df

            Name  Age       City  Salary
0        Kaushik   25     Irving   60000
1            Sri   26  San Diego   70000
2  Pamidimukkala   27       Cary   80000

In [41]:
#Permenant removal
df.drop('Salary',axis=1,inplace=True)
df

            Name  Age       City
0        Kaushik   25     Irving
1            Sri   26  San Diego
2  Pamidimukkala   27       Cary

In [42]:
##Update Age column
df['Age'] = df['Age']+1
df

            Name  Age       City
0        Kaushik   26     Irving
1            Sri   27  San Diego
2  Pamidimukkala   28       Cary

In [43]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,YEAR,MONTH,SUPPLIER,ITEM CODE,ITEM DESCRIPTION,ITEM TYPE,RETAIL SALES,RETAIL TRANSFERS,WAREHOUSE SALES
0,2020,1,REPUBLIC NATIONAL DISTRIBUTING CO,100009,BOOTLEG RED - 750ML,WINE,0.00,0.0,2.0
1,2020,1,PWSWN INC,100024,MOMENT DE PLAISIR - 750ML,WINE,0.00,1.0,4.0
2,2020,1,RELIABLE CHURCHILL LLLP,1001,S SMITH ORGANIC PEAR CIDER - 18.7OZ,BEER,0.00,0.0,1.0
3,2020,1,LANTERNA DISTRIBUTORS INC,100145,SCHLINK HAUS KABINETT - 750ML,WINE,0.00,0.0,1.0
4,2020,1,DIONYSOS IMPORTS INC,100293,SANTORINI GAVALA WHITE - 750ML,WINE,0.82,0.0,0.0

In [46]:
print("Data Types: \n", df.dtypes)
print("Statistical Summary: \n", df.describe())

Data Types:
 YEAR                  int64
MONTH                 int64
SUPPLIER             object
ITEM CODE            object
ITEM DESCRIPTION     object
ITEM TYPE            object
RETAIL SALES        float64
RETAIL TRANSFERS    float64
WAREHOUSE SALES     float64
dtype: object
Statistical Summary:
                 YEAR          MONTH   RETAIL SALES  RETAIL TRANSFERS  \
count  307645.000000  307645.000000  307642.000000     307645.000000
mean     2018.438525       6.423862       7.024071          6.936465
std         1.083061       3.461812      30.986238         30.237195
min      2017.000000       1.000000      -6.490000        -38.490000
25%      2017.000000       3.000000       0.000000          0.000000
50%      2019.000000       7.000000       0.320000          0.000000
75%      2019.000000       9.000000       3.267500          3.000000
max      2020.000000      12.000000    2739.000000       1990.830000

       WAREHOUSE SALES
count    307645.000000
mean         25.294597
std         249.916798
min       -7800.000000
25%           0.000000
50%           1.000000
75%           5.000000
max       18317.000000

In [47]:
df.describe()

,YEAR,MONTH,RETAIL SALES,RETAIL TRANSFERS,WAREHOUSE SALES
count,307645.000000,307645.000000,307642.000000,307645.000000,307645.000000
mean,2018.438525,6.423862,7.024071,6.936465,25.294597
std,1.083061,3.461812,30.986238,30.237195,249.916798
min,2017.000000,1.000000,-6.490000,-38.490000,-7800.000000
25%,2017.000000,3.000000,0.000000,0.000000,0.000000
50%,2019.000000,7.000000,0.320000,0.000000,1.000000
75%,2019.000000,9.000000,3.267500,3.000000,5.000000
max,2020.000000,12.000000,2739.000000,1990.830000,18317.000000